drop table village

create table village
(
	Id bigint PRIMARY KEY NOT NULL IDENTITY,
	CityId bigint NOT NULL,
	VillageName varchar(50)
);

insert into village
values
	(1, '頭城鎮'),
	(1, '礁溪鄉'),
	(1, '壯圍鄉'),
	(1, '員山鄉'),
	(1, '宜蘭市'),
	(1, '大同鄉'),
	(1, '五結鄉'),
	(1, '三星鄉'),
	(1, '羅東鎮'),
	(1, '冬山鄉'),
	(1, '南澳鄉'),
	(1, '蘇澳鎮')

insert into village
values
	(2, '大園區'),
	(2, '蘆竹區'),
	(2, '觀音區'),
	(2, '龜山區'),
	(2, '桃園區'),
	(2, '中壢區'),
	(2, '新屋區'),
	(2, '八德區'),
	(2, '平鎮區'),
	(2, '楊梅區'),
	(2, '大溪區'),
	(2, '龍潭區'),
	(2, '復興區')

insert into village
values
	(3, '新豐鄉'),
	(3, '湖口鄉'),
	(3, '新埔鎮'),
	(3, '竹北市'),
	(3, '關西鎮'),
	(3, '芎林鄉'),
	(3, '竹東鎮'),
	(3, '寶山鄉'),
	(3, '尖石鄉'),
	(3, '橫山鄉'),
	(3, '北埔鄉'),
	(3, '峨眉鄉'),
	(3, '五峰鄉')

insert into village
values
	(4, '竹南鎮'),
	(4, '頭份市'),
	(4, '三灣鄉'),
	(4, '造橋鄉'),
	(4, '後龍鎮'),
	(4, '南庄鄉'),
	(4, '頭屋鄉'),
	(4, '獅潭鄉'),
	(4, '苗栗市'),
	(4, '西湖鄉'),
	(4, '通霄鎮'),
	(4, '公館鄉'),
	(4, '銅鑼鄉'),
	(4, '泰安鄉'),
	(4, '苑裡鎮'),
	(4, '大湖鄉'),
	(4, '三義鄉'),
	(4, '卓蘭鎮')

insert into village
values
	(5, '伸港鄉'),
	(5, '和美鎮'),
	(5, '線西鄉'),
	(5, '鹿港鎮'),
	(5, '彰化市'),
	(5, '秀水鄉'),
	(5, '福興鄉'),
	(5, '花壇鄉'),
	(5, '芬園鄉'),
	(5, '芳苑鄉'),
	(5, '埔鹽鄉'),
	(5, '大村鄉'),
	(5, '二林鎮'),
	(5, '員林市'),
	(5, '溪湖鎮'),
	(5, '埔心鄉'),
	(5, '永靖鄉'),
	(5, '社頭鄉'),
	(5, '埤頭鄉'),
	(5, '田尾鄉'),
	(5, '大城鄉'),
	(5, '田中鎮'),
	(5, '北斗鎮'),
	(5, '竹塘鄉'),
	(5, '溪州鄉'),
	(5, '二水鄉')

insert into village
values
	(6, '仁愛鄉'),
	(6, '國姓鄉'),
	(6, '埔里鎮'),
	(6, '草屯鎮'),
	(6, '中寮鄉'),
	(6, '南投市'),
	(6, '魚池鄉'),
	(6, '水里鄉'),
	(6, '名間鄉'),
	(6, '信義鄉'),
	(6, '集集鎮'),
	(6, '竹山鎮'),
	(6, '鹿谷鄉')

insert into village
values
	(7, '麥寮鄉'),
	(7, '二崙鄉'),
	(7, '崙背鄉'),
	(7, '西螺鎮'),
	(7, '莿桐鄉'),
	(7, '林內鄉'),
	(7, '臺西鄉'),
	(7, '土庫鎮'),
	(7, '虎尾鎮'),
	(7, '褒忠鄉'),
	(7, '東勢鄉'),
	(7, '斗南鎮'),
	(7, '四湖鄉'),
	(7, '古坑鄉'),
	(7, '元長鄉'),
	(7, '大埤鄉'),
	(7, '口湖鄉'),
	(7, '北港鎮'),
	(7, '水林鄉'),
	(7, '斗六市')

insert into village
values
	(8, '大林鎮'),
	(8, '溪口鄉'),
	(8, '阿里山鄉'),
	(8, '梅山鄉'),
	(8, '新港鄉'),
	(8, '民雄鄉'),
	(8, '六腳鄉'),
	(8, '竹崎鄉'),
	(8, '東石鄉'),
	(8, '太保市'),
	(8, '番路鄉'),
	(8, '朴子市'),
	(8, '水上鄉'),
	(8, '中埔鄉'),
	(8, '布袋鎮'),
	(8, '鹿草鄉'),
	(8, '義竹鄉'),
	(8, '大埔鄉')

insert into village
values
	(9, '高樹鄉'),
	(9, '三地門鄉'),
	(9, '霧臺鄉'),
	(9, '里港鄉'),
	(9, '鹽埔鄉'),
	(9, '九如鄉'),
	(9, '長治鄉'),
	(9, '瑪家鄉'),
	(9, '屏東市'),
	(9, '內埔鄉'),
	(9, '麟洛鄉'),
	(9, '泰武鄉'),
	(9, '萬巒鄉'),
	(9, '竹田鄉'),
	(9, '萬丹鄉'),
	(9, '來義鄉'),
	(9, '潮州鎮'),
	(9, '新園鄉'),
	(9, '崁頂鄉'),
	(9, '新埤鄉'),
	(9, '南州鄉'),
	(9, '東港鎮'),
	(9, '林邊鄉'),
	(9, '佳冬鄉'),
	(9, '春日鄉'),
	(9, '獅子鄉'),
	(9, '琉球鄉'),
	(9, '枋山鄉'),
	(9, '牡丹鄉'),
	(9, '滿州鄉'),
	(9, '車城鄉'),
	(9, '恆春鎮'),
	(9, '枋寮鄉')

insert into village
values
	(10, '長濱鄉'),
	(10, '海端鄉'),
	(10, '池上鄉'),
	(10, '成功鎮'),
	(10, '關山鎮'),
	(10, '東河鄉'),
	(10, '鹿野鄉'),
	(10, '延平鄉'),
	(10, '卑南鄉'),
	(10, '臺東市'),
	(10, '太麻里鄉'),
	(10, '綠島鄉'),
	(10, '達仁鄉'),
	(10, '大武鄉'),
	(10, '蘭嶼鄉'),
	(10, '金峰鄉')

insert into village
values
	(11, '秀林鄉'),
	(11, '新城鄉'),
	(11, '花蓮市'),
	(11, '吉安鄉'),
	(11, '壽豐鄉'),
	(11, '萬榮鄉'),
	(11, '鳳林鎮'),
	(11, '豐濱鄉'),
	(11, '光復鄉'),
	(11, '卓溪鄉'),
	(11, '瑞穗鄉'),
	(11, '玉里鎮'),
	(11, '富里鄉')

insert into village
values
	(12, '白沙鄉'),
	(12, '西嶼鄉'),
	(12, '湖西鄉'),
	(12, '馬公市'),
	(12, '望安鄉'),
	(12, '七美鄉')

insert into village
values
	(13, '安樂區'),
	(13, '中山區'),
	(13, '中正區'),
	(13, '七堵區'),
	(13, '信義區'),
	(13, '仁愛區'),
	(13, '暖暖區')

insert into village
values
	(14, '北區'),
	(14, '香山區'),
	(14, '東區')

insert into village
values
	(15, '東區'),
	(15, '西區')

insert into village
values
	(16, '北投區'),
	(16, '士林區'),
	(16, '內湖區'),
	(16, '中山區'),
	(16, '大同區'),
	(16, '松山區'),
	(16, '南港區'),
	(16, '中正區'),
	(16, '萬華區'),
	(16, '信義區'),
	(16, '大安區'),
	(16, '文山區')

insert into village
values
	(17, '楠梓區'),
	(17, '左營區'),
	(17, '三民區'),
	(17, '鼓山區'),
	(17, '苓雅區'),
	(17, '新興區'),
	(17, '前金區'),
	(17, '鹽埕區'),
	(17, '前鎮區'),
	(17, '旗津區'),
	(17, '小港區'),
	(17, '那瑪夏區'),
	(17, '甲仙區'),
	(17, '六龜區'),
	(17, '杉林區'),
	(17, '內門區'),
	(17, '茂林區'),
	(17, '美濃區'),
	(17, '旗山區'),
	(17, '田寮區'),
	(17, '湖內區'),
	(17, '茄萣區'),
	(17, '阿蓮區'),
	(17, '路竹區'),
	(17, '永安區'),
	(17, '岡山區'),
	(17, '燕巢區'),
	(17, '彌陀區'),
	(17, '橋頭區'),
	(17, '大樹區'),
	(17, '梓官區'),
	(17, '大社區'),
	(17, '仁武區'),
	(17, '鳥松區'),
	(17, '大寮區'),
	(17, '鳳山區'),
	(17, '林園區'),
	(17, '桃源區')

insert into village
values
	(18, '石門區'),
	(18, '三芝區'),
	(18, '金山區'),
	(18, '淡水區'),
	(18, '萬里區'),
	(18, '八里區'),
	(18, '汐止區'),
	(18, '林口區'),
	(18, '五股區'),
	(18, '瑞芳區'),
	(18, '蘆洲區'),
	(18, '雙溪區'),
	(18, '三重區'),
	(18, '貢寮區'),
	(18, '平溪區'),
	(18, '泰山區'),
	(18, '新莊區'),
	(18, '石碇區'),
	(18, '板橋區'),
	(18, '深坑區'),
	(18, '永和區'),
	(18, '樹林區'),
	(18, '中和區'),
	(18, '土城區'),
	(18, '新店區'),
	(18, '坪林區'),
	(18, '鶯歌區'),
	(18, '三峽區'),
	(18, '烏來區')

insert into village
values
	(19, '北屯區'),
	(19, '西屯區'),
	(19, '北區'),
	(19, '南屯區'),
	(19, '西區'),
	(19, '東區'),
	(19, '中區'),
	(19, '南區'),
	(19, '和平區'),
	(19, '大甲區'),
	(19, '大安區'),
	(19, '外埔區'),
	(19, '后里區'),
	(19, '清水區'),
	(19, '東勢區'),
	(19, '神岡區'),
	(19, '龍井區'),
	(19, '石岡區'),
	(19, '豐原區'),
	(19, '梧棲區'),
	(19, '新社區'),
	(19, '沙鹿區'),
	(19, '大雅區'),
	(19, '潭子區'),
	(19, '大肚區'),
	(19, '太平區'),
	(19, '烏日區'),
	(19, '大里區'),
	(19, '霧峰區')

insert into village
values
	(20, '安南區'),
	(20, '中西區'),
	(20, '安平區'),
	(20, '東區'),
	(20, '南區'),
	(20, '北區'),
	(20, '白河區'),
	(20, '後壁區'),
	(20, '鹽水區'),
	(20, '新營區'),
	(20, '東山區'),
	(20, '北門區'),
	(20, '柳營區'),
	(20, '學甲區'),
	(20, '下營區'),
	(20, '六甲區'),
	(20, '南化區'),
	(20, '將軍區'),
	(20, '楠西區'),
	(20, '麻豆區'),
	(20, '官田區'),
	(20, '佳里區'),
	(20, '大內區'),
	(20, '七股區'),
	(20, '玉井區'),
	(20, '善化區'),
	(20, '西港區'),
	(20, '山上區'),
	(20, '安定區'),
	(20, '新市區'),
	(20, '左鎮區'),
	(20, '新化區'),
	(20, '永康區'),
	(20, '歸仁區'),
	(20, '關廟區'),
	(20, '龍崎區'),
	(20, '仁德區')

insert into village
values
	(21, '南竿鄉'),
	(21, '北竿鄉'),
	(21, '莒光鄉'),
	(21, '東引鄉')

insert into village
values
	(22, '金城鎮'),
	(22, '金湖鎮'),
	(22, '金沙鎮'),
	(22, '金寧鄉'),
	(22, '烈嶼鄉'),
	(22, '烏坵鄉')
